{
  "GeneralSettings": {
    "Application": {
      "IsEnabled": true, // Enables the PTMagic bot (needs restart to take effect)
      "TestMode": false, // If TestMode is active, no properties files will be changed
      "ProfitTrailerLicense": "ptlicense1asdf234fljlasdf014325ehm", // Your Profit Trailer license key (needed to change your settings)
      "ProfitTrailerLicenseXtra": "", // Licenses for additional bots for PTM to update (optional - comma separated list)
      "ProfitTrailerServerAPIToken": "", //Your Profit Trailer Server API Token
      "ProfitTrailerMonitorURL": "http://localhost:8081/", // The URL to your profit trailer monitor (needed to change your settings)
      "ProfitTrailerMonitorURLXtra": "", // URLs for additional bots you want PTM to update (optional  - comma separated list)
      "ProfitTrailerDefaultSettingName": "default", // Your Profit Trailer default setting name (needed to change your settings)
      "Exchange": "Bittrex", // The exchange your are running Profit Trailer on
      "TimezoneOffset": "+0:00", // Your timezone offset from UTC time
      //"MainFiatCurrency": "USD", // Your main fiat currency that will be used in the monitor
      "FloodProtectionMinutes": 0, // If a price trend is just zig-zagging around its trigger, you may want to protect your settings from getting switched back and forth every minute
      "InstanceName": "PT Magic", // The name of the instance of this bot. This will be used in your monitor and your Telegram messages. In case you are running more than one bot, you may set different names to separate them
      "CoinMarketCapAPIKey": "", //CoinMarketCap Api
      //"FreeCurrencyConverterAPIKey": "" // If "MainFiatCurrency" above is anything other than USD, you must obtain an API key from https://free.currencyconverterapi.com/free-api-key 
    },
    "Monitor": {
      "IsPasswordProtected": true, // Defines if your monitor will be asking to setup a password on its first start
      "OpenBrowserOnStart": false, // If active, a browser window will open as soon as you start the monitor
      "Port": 8080, // The port you want to run your monitor on
      "RootUrl": "/", // The root Url of your monitor
      "AnalyzerChart": "", // By default the chart on the Market Analyzer page will use your default currency against USD.  You can change that here. (eg., BTCEUR)
      "GraphIntervalMinutes": 60, // The interval for the monitor market trend graph to draw points in minutes
      "GraphMaxTimeframeHours": 24, // This will enable you to define the timeframe that your graph for market trends covers in hours
      "ProfitsMaxTimeframeDays": 30, // This will enable you to define the timeframe for your dashboard profits graph in days
      "RefreshSeconds": 30, // The refresh interval of your monitor main page
      "LinkPlatform": "TradingView", // The platform to which the pair name will link if you click on it
      "MaxSalesRecords": 99999, // The maximum number of sales records pulled from Profit Trailer. Changes require a Monitor Restart.
      "MaxTopMarkets": 20, // The amount of top markets being shown in your Sales Analyzer
      "MaxDailySummaries": 10, // The amount of "Last Days" being shown in your Sales Analyzer
      "MaxMonthlySummaries": 10, // The amount of "Last Months" being shown in your Sales Analyzer
      "TvStudyA": "BB@tv-basicstudies", // See available STUDIES at https://www.tradingview.com/wiki/Widget:TradingView_Widget
      "TvStudyB": "",
      "TvStudyC": "",
      "TvStudyD": ""
    },
    "Backup": {
      "IsEnabled": true, // Enables a backup procedure for your properties files. Before every switch PTMagic will backup the current properties
      "MaxHours": 12 // Max number of hours to keep backup files
    },
    "Telegram": {
      "IsEnabled": false, // Enables PT Magic to send Telegram messages
      "BotToken": "", // Your Telegram bot token
      "ChatId": 0, // Your Telegram Chat ID
      "SilentMode": false // If SilentMode is active, no notification sound or vibration will happen when the bot sends a Telegram message
    }
  }
}